; domain
(define (domain blocksworld)
    (:requirements :strips :typing)
    (:types
        block object
        surface object
        robot object
    )
    (:predicates
        (on ?b1 - block ?b2 - block)
        (on-table ?b - block)
        (clear ?o - object)
        (holding ?b - block)
        (arm-empty)
    )

    (:action pick-up
        :parameters (?b - block ?s - surface)
        :precondition (and (clear ?b) (on-table ?b) (arm-empty))
        :effect (and (not (on-table ?b)) (not (clear ?b)) (not (arm-empty)) (holding ?b))
    )

    (:action stack
        :parameters (?b1 - block ?b2 - block)
        :precondition (and (holding ?b1) (clear ?b2))
        :effect (and (not (holding ?b1)) (not (clear ?b2)) (clear ?b1) (on ?b1 ?b2) (arm-empty))
    )

    (:action unstack
        :parameters (?b1 - block ?b2 - block)
        :precondition (and (on ?b1 ?b2) (clear ?b1) (arm-empty))
        :effect (and (not (on ?b1 ?b2)) (not (clear ?b1)) (not (arm-empty)) (holding ?b1) (clear ?b2))
    )

    (:action put-down
        :parameters (?b - block ?s - surface)
        :precondition (and (holding ?b))
        :effect (and (not (holding ?b)) (on-table ?b) (clear ?b) (arm-empty))
    )
)

; problem
(define (problem blocksworld-problem)
    (:domain blocksworld)
    (:objects
        a b c d - block
        table - surface
        robot1 - robot
    )
    (:init
        (on-table a)
        (on-table b)
        (on-table c)
        (on d c)
        (clear a)
        (clear b)
        (clear d)
        (arm-empty)
        (clear table)
    )
    (:goal (and
        (on b a)
        (on c b)
        (on d c)
        (on-table a)
        (clear d)
    ))
)

; plan
1. (pick-up b table)
   deleted: (on-table b) (clear b) (arm-empty)
   added: (holding b)
   goals met: 3 of 5
2. (stack b a)
   deleted: (holding b) (clear a)
   added: (clear b) (on b a) (arm-empty)
   goals met: 4 of 5
3. (unstack d c)
   deleted: (on d c) (clear d) (arm-empty)
   added: (holding d) (clear c)
   goals met: 2 of 5
4. (put-down d table)
   deleted: (holding d)
   added: (on-table d) (clear d) (arm-empty)
   goals met: 3 of 5
5. (pick-up c table)
   deleted: (on-table c) (clear c) (arm-empty)
   added: (holding c)
   goals met: 3 of 5
6. (stack c b)
   deleted: (holding c) (clear b)
   added: (clear c) (on c b) (arm-empty)
   goals met: 4 of 5
7. (pick-up d table)
   deleted: (on-table d) (clear d) (arm-empty)
   added: (holding d)
   goals met: 3 of 5
8. (stack d c)
   deleted: (holding d) (clear c)
   added: (clear d) (on d c) (arm-empty)
   goals met: 5 of 5
